DataProcessors/ЗагрузкаИзExcel_sr28.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаИзExcel_sr28</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ХимическийСоставПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>ХимическийСоставПродуктов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПродуктыПитания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Нутриент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нутриенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПродуктыПитания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>ПродуктыПитания</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Калорийность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Белки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Углеводы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаИзExcel_sr28/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере()
	
	ИмяФайла = ПолучитьИмяФайла();
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");		
		Эксель.DisplayAlerts = 0; 
		Эксель.Visible = 0; 		
	Исключение   		
		
		Эксель = Неопределено;   					
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки() + Символы.ПС +
					"Ошибка загрузки файла. "
					+ Символы.ВК + "Возможные причины:"  					 
					+ Символы.ВК + "1. На компьютере не установлен MS Excel;"
					+ Символы.ВК + "2. Выбранный файл поврежден;";
		Сообщение.Сообщить(); 
					
	КонецПопытки;
				
	Если Эксель <> Неопределено Тогда  		
		
		Книга = Эксель.WorkBooks.Open(ИмяФайла);
		Листы = Книга.Sheets; 				
		
	КонецЕсли;
	
	Если Эксель <> Неопределено Тогда 
		
		Попытка
			ЛистЭксель = Книга.Sheets(ИмяЛиста(Книга, 1));	
			ЛистЕдИзм  = Книга.Sheets(ИмяЛиста(Книга, 2));
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки; 
		
		КлючЯндексПереводчикAPI = "trnsl.1.1.20151208T101536Z.8e35ce5dea458c82.5efdd116716bddecabf4af89fba2159c31039bf7";		
	    КоличествоКолонок 		= ЛистЭксель.Cells(1,1).SpecialCells(11).Column;
	    КоличествоСтрок 		= ЛистЭксель.Cells(1,1).SpecialCells(11).Row; 				
		 
		Область = ЛистЭксель.Range(ЛистЭксель.Cells(1,1), ЛистЭксель.Cells(КоличествоСтрок, КоличествоКолонок));
		ОбластьЕдИзм = ЛистЕдИзм.Range(ЛистЕдИзм.Cells(1,1), ЛистЕдИзм.Cells(ЛистЕдИзм.Cells(1,1).SpecialCells(11).Row,2));
		
		НачатьТранзакцию();
		
		Если Область.Value <> Неопределено Тогда
			
			ДанныеЭксель = Область.Value.Выгрузить();	
			МассивЕдИзм  = ОбластьЕдИзм.Value.Выгрузить();
				
			Для ИндексСтроки = 1 По КоличествоСтрок - 1 Цикл  				
				
				Наименование				= ДанныеЭксель[1][ИндексСтроки];
				ПереводНаименования         = ПолучитьЯндексПереводСтроки(Наименование, КлючЯндексПереводчикAPI);
				СсылкаПродукта				= Справочники.ПродуктыПитания.ПолучитьСсылку();
				НовыйПродукт 				= Справочники.ПродуктыПитания.СоздатьЭлемент();  
				НовыйПродукт.Родитель		= Родитель;
				НовыйПродукт.Наименование	= Наименование + "(" + ПереводНаименования + ")";
				НовыйПродукт.Источник		= Справочники.ИсточникиИнформации.USDA_NND_SR28;
				НовыйПродукт.УстановитьСсылкуНового(СсылкаПродукта);
				
				Набор = РегистрыСведений.ХимическийСоставПродуктов.СоздатьНаборЗаписей();
				Набор.Отбор.Продукт.Установить(СсылкаПродукта);
				
				Для ИндексСтолбца = 2 По КоличествоКолонок - 1 Цикл	
					
					НоваяЗапись = Неопределено; 
					
					ЗначениеВЯчейке = ДанныеЭксель[ИндексСтолбца][ИндексСтроки];
					
					Если ЗначениеЗаполнено(ЗначениеВЯчейке) Тогда
						
						Количество = Число(ЗначениеВЯчейке);
						
						Если ИндексСтолбца = 2 Тогда
							НовыйПродукт.Белки = Количество;
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Белки, Количество);
						ИначеЕсли ИндексСтолбца = 3 Тогда
							НовыйПродукт.Жиры = Количество;	
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Жиры, Количество);
						ИначеЕсли ИндексСтолбца = 4 Тогда   
							НовыйПродукт.Углеводы = Количество;
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Углеводы, Количество);
						ИначеЕсли ИндексСтолбца = 6 Тогда
							НовыйПродукт.Калорийность = Количество;
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Калорийность, Количество);
																		
						ИначеЕсли ИндексСтолбца = 14 Тогда 							
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Вода, Количество); 						
						ИначеЕсли ИндексСтолбца = 21 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ПищевыеВолокна, Количество);	
							
						ИначеЕсли ИндексСтолбца = 22 Тогда 							
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Ca, Количество);
						ИначеЕсли ИндексСтолбца = 23 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Fe, Количество);
						ИначеЕсли ИндексСтолбца = 24 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Mg, Количество);
						ИначеЕсли ИндексСтолбца = 25 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.P, Количество);
						ИначеЕсли ИндексСтолбца = 26 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.K, Количество);  							
						ИначеЕсли ИндексСтолбца = 27 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Na, Количество);
						ИначеЕсли ИндексСтолбца = 28 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Zn, Количество);
						ИначеЕсли ИндексСтолбца = 29 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Cu, Количество);
						ИначеЕсли ИндексСтолбца = 30 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.F, Количество);
						ИначеЕсли ИндексСтолбца = 31 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Mn, Количество);
						ИначеЕсли ИндексСтолбца = 32 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Se, Количество);
							
						//витамин А						
						ИначеЕсли ИндексСтолбца = 33 Тогда //Vitamin A, IU
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминA, Количество);
						ИначеЕсли ИндексСтолбца = 34 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминA, Количество);
						ИначеЕсли ИндексСтолбца = 35 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминA, Количество);
						ИначеЕсли ИндексСтолбца = 36 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминA, Количество);
						ИначеЕсли ИндексСтолбца = 37 Тогда //Carotene, alpha
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминA, Количество);  							
							
						ИначеЕсли ИндексСтолбца = 38 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество);
							
						//витамин D
						ИначеЕсли ИндексСтолбца = 39 Тогда //Vitamin D
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминD, Количество);
						ИначеЕсли ИндексСтолбца = 40 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминD, Количество);
						ИначеЕсли ИндексСтолбца = 41 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминD, Количество);
						ИначеЕсли ИндексСтолбца = 42 Тогда //Vitamin D2 (ergocalciferol)
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминD, Количество);
							
							
						ИначеЕсли ИндексСтолбца = 46 Тогда //Tocopherol, beta
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество);
						ИначеЕсли ИндексСтолбца = 47 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество);
						ИначеЕсли ИндексСтолбца = 48 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество); 							
						ИначеЕсли ИндексСтолбца = 49 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество);
						ИначеЕсли ИндексСтолбца = 50 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество);
						ИначеЕсли ИндексСтолбца = 51 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество);
						ИначеЕсли ИндексСтолбца = 52 Тогда //Tocotrienol, delta
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество);  				
												
							
						ИначеЕсли ИндексСтолбца = 53 Тогда //Vitamin C, total ascorbic acid
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминC, Количество);
						ИначеЕсли ИндексСтолбца = 54 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB1, Количество);
						ИначеЕсли ИндексСтолбца = 55 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB2, Количество);
						ИначеЕсли ИндексСтолбца = 56 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB3, Количество);
						ИначеЕсли ИндексСтолбца = 57 Тогда //Pantothenic acid
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB5, Количество); 							
						ИначеЕсли ИндексСтолбца = 58 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB6, Количество);
						ИначеЕсли ИндексСтолбца = 59 Тогда //Folate, total
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB9, Количество); 							
						ИначеЕсли ИндексСтолбца = 60 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB12, Количество); 					
						ИначеЕсли ИндексСтолбца = 61 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB4, Количество);
							
						ИначеЕсли ИндексСтолбца = 62 Тогда //Menaquinone-4
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминK, Количество);
						ИначеЕсли ИндексСтолбца = 64 Тогда //Vitamin K (phylloquinone)
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминK, Количество);
							
						ИначеЕсли ИндексСтолбца = 65 Тогда //Folic acid
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB9, Количество);
						ИначеЕсли ИндексСтолбца = 66 Тогда 
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB9, Количество);
						ИначеЕсли ИндексСтолбца = 67 Тогда //Folate, DFE
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB9, Количество);							
						ИначеЕсли ИндексСтолбца = 68 Тогда //Betaine
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Бетаин, Количество);						
							
						ИначеЕсли ИндексСтолбца = 69 Тогда //Tryptophan
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Триптофан, Количество);
						ИначеЕсли ИндексСтолбца = 70 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Треонин, Количество); 							
						ИначеЕсли ИндексСтолбца = 71 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Изолейцин, Количество);
						ИначеЕсли ИндексСтолбца = 72 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Лейцин, Количество); 							
						ИначеЕсли ИндексСтолбца = 73 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Лизин, Количество);							
						ИначеЕсли ИндексСтолбца = 74 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Метионин, Количество); 							
						ИначеЕсли ИндексСтолбца = 75 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Цистин, Количество); 							
						ИначеЕсли ИндексСтолбца = 76 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Фенилаланин, Количество); 							
						ИначеЕсли ИндексСтолбца = 77 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Тирозин, Количество);
						ИначеЕсли ИндексСтолбца = 78 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Валин, Количество); 							
						ИначеЕсли ИндексСтолбца = 79 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Аргинин, Количество);
						ИначеЕсли ИндексСтолбца = 80 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Гистидин, Количество);
						ИначеЕсли ИндексСтолбца = 81 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Аланин, Количество); 							
						ИначеЕсли ИндексСтолбца = 82 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.АспарагиноваяКислота, Количество);
						ИначеЕсли ИндексСтолбца = 83 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ГлутаминоваяКислота, Количество);
						ИначеЕсли ИндексСтолбца = 84 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Глицин, Количество);
						ИначеЕсли ИндексСтолбца = 85 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Пролин, Количество);
						ИначеЕсли ИндексСтолбца = 86 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Серин, Количество);
						ИначеЕсли ИндексСтолбца = 87 Тогда //Hydroxyproline
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Гидроксипролин, Количество);
													
						ИначеЕсли ИндексСтолбца = 88 Тогда //Vitamin E, added
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминE, Количество);
						ИначеЕсли ИндексСтолбца = 89 Тогда //Vitamin B-12, added
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.ВитаминB12, Количество);  												
						
						ИначеЕсли ИндексСтолбца = 90 Тогда
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Холестерин, Количество); 					
							
						ИначеЕсли ИндексСтолбца = 92 Тогда //Fatty acids, total saturated
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.НЖК, Количество);
						ИначеЕсли ИндексСтолбца = 119 Тогда //Fatty acids, total monounsaturated
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.МНЖК, Количество);
						
							
						ИначеЕсли ИндексСтолбца = 112 Тогда //20:5 n-3 (EPA)
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега3, Количество);
						ИначеЕсли ИндексСтолбца = 114 Тогда //22:5 n-3 (DPA)
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега3, Количество);
							
						ИначеЕсли ИндексСтолбца = 132 Тогда //20:2 n-6 c,c
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега6, Количество);
						ИначеЕсли ИндексСтолбца = 135 Тогда //18:2 n-6 c,c
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега6, Количество); 							
						ИначеЕсли ИндексСтолбца = 137 Тогда //18:3 n-6 c,c,c
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега6, Количество);
							
						ИначеЕсли ИндексСтолбца = 144 Тогда //18:3 n-3 c,c,c (ALA)
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега3, Количество);
						ИначеЕсли ИндексСтолбца = 145 Тогда //20:3 n-3
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега3, Количество);
							
						ИначеЕсли ИндексСтолбца = 146 Тогда //20:3 n-6
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега6, Количество);
						ИначеЕсли ИндексСтолбца = 147 Тогда //20:4 n-6
							НоваяЗапись = ДобавитьЗаписьВНабор(Набор, СсылкаПродукта, Справочники.Нутриенты.Омега6, Количество); 						
							
						КонецЕсли;
						
						Если НоваяЗапись <> Неопределено Тогда
							НоваяЗапись.Количество = НоваяЗапись.Количество	/ ПолучитьДелительПоНазваниюКолонки(МассивЕдИзм, ИндексСтолбца, НоваяЗапись.Нутриент);			
						КонецЕсли; 
						
					КонецЕсли;  										 
					
				КонецЦикла; 
				
				НовыйПродукт.Записать();
				Набор.Записать();
				
			КонецЦикла;
			
		КонецЕсли; 
		
		ЗафиксироватьТранзакцию();
		
		Эксель.Quit(); 
		
	КонецЕсли; 			
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ЗагрузитьИзФайлаНаСервере();
КонецПроцедуры  

Функция ИмяЛиста(Книга, НомерЛиста)
	
	Попытка
		ИмяЛиста = Книга.Sheets(НомерЛиста).Name;
		Возврат ИмяЛиста;
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьИмяФайла()
	
	Результат = "d:\Рабочая\Сопроводительные\ИРП\data.xlsx";
	//Результат = ПолучитьИмяВременногоФайла();	
	
	//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	//
	//Макет = ОбработкаОбъект.ПолучитьМакет("Файл_USDANationalNutrientDatabase");
	//Макет.Записать(Результат);	 	
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьЗаписьВНабор(Набор, Продукт, Нутриент, Значение)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Нутриент) И ЗначениеЗаполнено(Значение) Тогда
		
		Результат 				= Набор.Добавить();
		Результат.Продукт		= Продукт;
		Результат.Нутриент 		= Нутриент;
		Результат.Количество	= Значение;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции
 
Функция ПолучитьДелительПоНазваниюКолонки(МассивЕдИзм, НомерСтроки, Нутриент)
	
	Результат = 1; 
	
	Показатель = МассивЕдИзм[1][НомерСтроки]; 	
	
	Если Найти(ВРег(Показатель), "MCG") ИЛИ Найти(ВРег(Показатель), ВРег("µg")) > 0 Тогда
		Результат = 1000000;	
	ИначеЕсли Найти(ВРег(Показатель), "MG") ИЛИ Найти(ВРег(Показатель), ВРег("mg")) > 0 Тогда 				
		Результат = 1000;
	ИначеЕсли Найти(ВРег(Показатель), "IU") > 0 Тогда 				
		Результат = 1000000 / Справочники.Нутриенты.ПолучитьКоэффициентПересчетаМЕ_в_мкг(Нутриент);
	Иначе
		Результат = 1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьЯндексПереводСтроки(АнглСтрока, Ключ)
	
	Результат 	= "";
	Каталог   	= "/api/v1.5/tr/translate?key=%1%&text=%2%&lang=en-ru"; 	
	Каталог 	= СтрЗаменить(Каталог, "%1%", Ключ);
	Каталог 	= СтрЗаменить(Каталог, "%2%", АнглСтрока);
	
	ЗапросHTTP 		= Новый HTTPСоединение("translate.yandex.net",,,,,, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено ));
	ИмяФайла 		= ПолучитьИмяВременногоФайла();
	ЧтениеXML 		= Новый ЧтениеXML; 
	ПостроительДОМ 	= Новый ПостроительDOM; 
	Флаг 			= Ложь; 
	Наименование	= "";
		
	ЗапросHTTP.Получить(Каталог, ИмяФайла); 
	
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	ДокументXML		= ПостроительДОМ.Прочитать(ЧтениеXML); 	
	ЭлементыXML		= ДокументXML.ПолучитьЭлементыПоИмени("TEXT");
	
	Если ЭлементыXML.Количество() > 0 Тогда
		Результат = ЭлементыXML[0].ТекстовоеСодержимое;		
	КонецЕсли; 		
	
	Возврат Результат;
	
КонецФункции
